<!DOCTYPE html>
<html>

<body>
    <!-- Весь html поскольку задача короткая для простоты пишем в форме скрипта php -->
    <?
    // Вытаскиваем из списка глобальных переменных массив переменных, пришедший по методу GET
    $va =  $GLOBALS["_GET"];
    // Берём оттуда наши переменные (соответствуют атрибутам name в тэгах <input> на форме)
    $tblheader = $va["tblheader"];
    $tblrows = $va["tblrows"];
    $tblcols = $va["tblcols"];

    // Чисто для отладки, поглядеть, что мы всё правильно делаем
    echo "<li>Заголовок: $tblheader";
    echo "<li>Строк:  $tblrows";
    echo "<li>Столбцов: $tblcols";
    echo "<br>";

    // создаем массив размера tblrows*tblcols
    for ($i = 1; $i <= $tblrows; $i++) {
        for ($j = 1; $j <= $tblcols; $j++) {
            // заполняем случайными значениями от 0 до 100 
            $vals[$i][$j] = rand(0, 100);
            if ($i == 1 && $j == 1) {
                // первый элемент делаем максимумом и минимумом
                $min = $vals[$i][$j];
                $max = $vals[$i][$j];
            } else {
                // каждый следующий проверяем, если больше/меньше, обновляем максимум и минимум
                if ($vals[$i][$j] < $min) {
                    $min = $vals[$i][$j];
                }
                if ($vals[$i][$j] > $max) {
                    $max = $vals[$i][$j];
                }
            }
        }
    }
    // Тут просто выводим значения для проверки, если вдруг что-то пошло не так
    echo "Минимум: $min <br>";
    echo "Максимум: $max <br>";

    echo "<br>";
    echo "<br>";

    /* создаём функцию, которая рисует таблицу, передаём в неё массив значений, 
     заголовок, количество строк и столбцов, минимум и максимум */
    function createTable($vals, $tblheader, $tblrows, $tblcols, $min, $max)
    {
        echo "<table name='tb' border=1 cellpadding=1 cellspacing=0>"; // начинаем таблицу
        echo "<caption>$tblheader</caption>"; // заполняем заголовок
        // $i - соответствует номеру строки $j - соответствует номеру столбца
        for ($i = 1; $i <= $tblrows; $i++) {
            // На каждой итерации внешнего цикла будет создаваться тэг <tr> - строка матрицы
            echo "<tr>";
            for ($j = 1; $j <= $tblcols; $j++) {
                $value = $vals[$i][$j]; // для простоты сначала присваиваем значение из массива, а потом его меняем по условию
                if ($i == $j) { // проверяем главную диагональ (индексы равны)
                    $value = $min;
                }
                // Побочную диагональ находим, складывая индексы и сравнивая с меньшей из двух сторон матрицы
                if ($i + $j == min($tblcols, $tblrows) + 1) {
                    $value = $max;
                }
                // На каждой внутренней итерации цикла в строку добавляем ячейку данных <td> - столбец матрицы
                echo "<td> $value </td>";
            }
            echo "</tr>"; // перед переходом на следующую итерацию внешнего цикла строку заканчиваем
        }
        echo "</table>"; // прошли по всему циклу и закончили таблицу
    }

    // вызываем функцию создания таблицы, передаём в неё все необходимые параметры 
    createTable($vals, $tblheader, $tblrows, $tblcols, $min, $max)

    ?>
</body>

</html>